MAX_VOCAB_SIZE = 200000
UNK, PAD = '<UNK>', '<PAD>'

origin_train_path = 'DTA_original_data/DTA-topic-extraction_train.jsonl'
origin_test_path = 'DTA_original_data/DTA-topic-extraction_test.jsonl'

write_data_path = \
[
    'related_data/train_related/all.txt',
    'related_data/train_related/train.txt',
    'related_data/train_related/val.txt',
    'related_data/train_related/vocab.pkl',
    'related_data/train_related/word_embedding.npz',
    'related_data/word_vectors/sgns.sogou.char',
]

emb_dim = 300
epoch_num = 10
input_size = 300
hidden_size = 256
sen_hidden_size = 128
num_layers = 2
learning_rate = 1e-3
model_name = 'model'

best_model_out_path_lv1 = 'saved_model/model_lv1.pth'
best_model_out_path_lv3 = 'saved_model/model_lv3.pth'

submit_path = 'related_data/submit/submit.jsonl'

label_mapping_lv1 = {'B_破冰介绍': 0,
                 'I_破冰介绍': 1,
                 'B_地理区位': 2,
                 'I_地理区位': 3,
                 'B_沙盘讲解': 4,
                 'I_沙盘讲解': 5,
                 'B_样板间介绍': 6,
                 'I_样板间介绍': 7,
                 'B_洽谈商议': 8,
                 'I_洽谈商议': 9,
                 'B_其他': 10,
                 'I_其他': 11}

label_mapping_lv3 = {
        'B_开场接待': 0, 'I_开场接待': 1, 'B_录音告知': 2, 'I_录音告知': 3, 'B_品牌实力': 4, 'I_品牌实力': 5, 'B_布局城市': 6, 'I_布局城市': 7,
        'B_品牌亮点': 8, 'I_品牌亮点': 9, 'B_周边': 10, 'I_周边': 11, 'B_地段': 12, 'I_地段': 13, 'B_环境': 14, 'I_环境': 15,
        'B_周边风景': 16, 'I_周边风景': 17, 'B_交通': 18, 'I_交通': 19, 'B_商业': 20, 'I_商业': 21, 'B_周边休闲': 22, 'I_周边休闲': 23,
        'B_小区设施': 24, 'I_小区设施': 25, 'B_医疗': 26, 'I_医疗': 27, 'B_养老': 28, 'I_养老': 29, 'B_教育': 30, 'I_教育': 31,
        'B_公摊': 32, 'I_公摊': 33, 'B_架空层': 34, 'I_架空层': 35, 'B_楼层': 36, 'I_楼层': 37, 'B_容积率': 38, 'I_容积率': 39,
        'B_绿化景观': 40, 'I_绿化景观': 41, 'B_房屋类型': 42, 'I_房屋类型': 43, 'B_物业': 44, 'I_物业': 45, 'B_物业费': 46, 'I_物业费': 47,
        'B_户型': 48, 'I_户型': 49, 'B_户数': 50, 'I_户数': 51, 'B_朝向': 52, 'I_朝向': 53, 'B_停车': 54, 'I_停车': 55, 'B_间距': 56,
        'I_间距': 57, 'B_电梯': 58, 'I_电梯': 59, 'B_交付时间': 60, 'I_交付时间': 61, 'B_入户玄关': 62, 'I_入户玄关': 63, 'B_客厅': 64,
        'I_客厅': 65, 'B_卧室': 66, 'I_卧室': 67, 'B_卫生间': 68, 'I_卫生间': 69, 'B_厨房餐厅': 70, 'I_厨房餐厅': 71, 'B_阳台': 72,
        'I_阳台': 73, 'B_阁楼': 74, 'I_阁楼': 75, 'B_地下室': 76, 'I_地下室': 77, 'B_院子': 78, 'I_院子': 79, 'B_书房': 80, 'I_书房': 81,
        'B_保姆房': 82, 'I_保姆房': 83, 'B_衣帽间': 84, 'I_衣帽间': 85, 'B_储物间': 86, 'I_储物间': 87, 'B_挑高': 88, 'I_挑高': 89,
        'B_装修': 90, 'I_装修': 91, 'B_窗户': 92, 'I_窗户': 93, 'B_遮挡': 94, 'I_遮挡': 95, 'B_面积': 96, 'I_面积': 97, 'B_认知途径': 98,
        'I_认知途径': 99, 'B_置业意向': 100, 'I_置业意向': 101, 'B_贷款': 102, 'I_贷款': 103, 'B_首付': 104, 'I_首付': 105, 'B_定金': 106,
        'I_定金': 107, 'B_价格': 108, 'I_价格': 109, 'B_性价比': 110, 'I_性价比': 111, 'B_升值': 112, 'I_升值': 113, 'B_政策': 114,
        'I_政策': 115, 'B_优惠': 116, 'I_优惠': 117, 
        'B_产品规模': 118, 'I_产品规模': 119,
        'B_客户送别': 120, 'I_客户送别': 121,
        'B_客户信息': 122, 'I_客户信息': 123, 
        'B_开盘情况': 124, 'I_开盘情况': 125, 
        'B_设计风格': 126, 'I_设计风格': 127, 
        'B_健康': 128, 'I_健康': 129,
        'B_安全': 130, 'I_安全': 131,
        'B_管家': 132, 'I_管家': 133,
        'B_项目引导': 134, 'I_项目引导': 135,
        'B_签约':136,'I_签约':137,
        'B_地产相关': 138, 'I_地产相关': 139,
        'B_其他': 141, 'I_其他': 142
}
